DataProcessors/бит_ГрупповаяПечатьЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповаяПечатьЧеков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОсн</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатыКУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазбиватьПоЛицевымСчетам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздаватьСчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_СтатусыГрупповойПечатиЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_СтатусыГрупповойПечатиЧеков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗавершенаБезОшибок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиПоследнегоЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОборудованиеПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОборудованиеПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляет1СSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляет1СEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьКонтактныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиСистемыНалогообложенияПроверены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_ДоступныеВидыОплатДляКассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ДоступныеВидыОплатДляКассыККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/бит_ГрупповаяПечатьЧеков/Forms/ФормаПечать/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьEmailПроживающего(ПлатежныйДокумент)

	Результат = "";
	Если ЗначениеЗаполнено(ПлатежныйДокумент.бит_ЛицевойСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЛицевойСчет", ПлатежныйДокумент.бит_ЛицевойСчет);
		Запрос.УстановитьПараметр("Дата", КонецМесяца(ПериодОплат.ДатаНачала));
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ПолучательПисьма,
			|	КИ.Представление КАК АдресПочты
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК КИ
			|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = КИ.Ссылка
			|			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
			|			И (КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПроживающего))
			|ГДЕ
			|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
			|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
		
		ТЗКонтИнф = Запрос.Выполнить().Выгрузить();
		Если ТЗКонтИнф.Количество() > 0 Тогда
			Результат = Строка(ТЗКонтИнф[0].АдресПочты);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьТелефонПроживающего(ЛицевойСчет)

	Результат = "";
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("Дата", КонецМесяца(ПериодОплат.ДатаНачала));
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ПолучательПисьма,
			|	КИ.Представление КАК Телефон
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК КИ
			|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = КИ.Ссылка
			|			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
			|			И (КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПроживающего))
			|ГДЕ
			|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
			|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
		
		ТЗКонтИнф = Запрос.Выполнить().Выгрузить();
		Если ТЗКонтИнф.Количество() > 0 Тогда
			Результат = Строка(ТЗКонтИнф[0].Телефон);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция СтатусГрупповойПечатиНаСервере()

	Результат = Новый Структура;
    Результат.Вставить("ЕстьРаботающаяОбработка", Ложь);
    Результат.Вставить("ВидОплаты", ВидОплаты);
    Результат.Вставить("РабочееМесто");
    Результат.Вставить("ДатаНачала");
    Результат.Вставить("ДатаОкончания");
	
	НаборЗаписейДляКорректировки = РегистрыСведений.лб_СтатусыГрупповойПечатиЧеков.СоздатьНаборЗаписей();
	НаборЗаписейДляКорректировки.Отбор.ВидОплаты.Использование 	= Истина;
	НаборЗаписейДляКорректировки.Отбор.ВидОплаты.Значение 		= ВидОплаты;
	НаборЗаписейДляКорректировки.Отбор.ДатаНачала.Использование 	= Истина;
	НаборЗаписейДляКорректировки.Отбор.ДатаОкончания.Использование 	= Истина;
	НаборЗаписейДляКорректировки.Отбор.ДатаНачалаПечати.Использование 	= Истина;
	
	
	НаборЗаписейСтатусыГрупповойПечатиЧеков	= РегистрыСведений.лб_СтатусыГрупповойПечатиЧеков.СоздатьНаборЗаписей();
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.Завершена.Использование 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.Завершена.Значение 		= Ложь;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Использование 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Значение 		= ВидОплаты;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Прочитать();
	
	Если НаборЗаписейСтатусыГрупповойПечатиЧеков.Количество() > 0 Тогда
		
		ЕстьИзменения = Ложь;
		Для Каждого Запись ИЗ НаборЗаписейСтатусыГрупповойПечатиЧеков Цикл
			Если ТекущаяДатаСеанса() - Запись.ДатаПечатиПоследнегоЧека > 60 Тогда
				
				НаборЗаписейДляКорректировки.Отбор.ДатаНачала.Значение		 = Запись.ДатаНачала;
				НаборЗаписейДляКорректировки.Отбор.ДатаОкончания.Значение 	 = Запись.ДатаОкончания;
				НаборЗаписейДляКорректировки.Отбор.ДатаНачалаПечати.Значение = Запись.ДатаНачалаПечати;
				НаборЗаписейДляКорректировки.Прочитать();
				Если НаборЗаписейДляКорректировки.Количество() > 0 Тогда
					НаборЗаписейДляКорректировки[0].Завершена = Истина;
					
					Попытка
						НаборЗаписейДляКорректировки.Записать(Истина);
					Исключение
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
				
			ИначеЕсли ПериодОплат.ДатаНачала <= Запись.ДатаОкончания И ПериодОплат.ДатаОкончания >= Запись.ДатаНачала Тогда
				Результат.ЕстьРаботающаяОбработка = Истина;
				Результат.РабочееМесто			  = Запись.РабочееМесто;
				Результат.ДатаНачала 			  = Запись.ДатаНачала;
				Результат.ДатаОкончания 		  = Запись.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 

	Возврат Результат;

КонецФункции

&НаСервере
Функция ЗаписатьНачалоПечатиЧекаНаСервере()

	Результат = Истина;
	
	НаборЗаписейСтатусыГрупповойПечатиЧеков	= РегистрыСведений.лб_СтатусыГрупповойПечатиЧеков.СоздатьНаборЗаписей();
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.Завершена.Использование	 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.Завершена.Значение 			= Ложь;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Использование 		= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Значение 			= ВидОплаты;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаНачала.Использование	 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаНачала.Значение 			= ПериодОплат.ДатаНачала;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаОкончания.Использование 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаОкончания.Значение 		= ПериодОплат.ДатаОкончания;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Прочитать();
	Если НаборЗаписейСтатусыГрупповойПечатиЧеков.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НаборЗаписейСтатусыГрупповойПечатиЧеков Цикл
			Запись.ДатаПечатиПоследнегоЧека = ТекущаяДатаСеанса();
		КонецЦикла;
			
	Иначе
		НоваяЗапись=НаборЗаписейСтатусыГрупповойПечатиЧеков.Добавить();
		НоваяЗапись.ВидОплаты = ВидОплаты;
		НоваяЗапись.ДатаНачала = ПериодОплат.ДатаНачала;
		НоваяЗапись.ДатаОкончания = ПериодОплат.ДатаОкончания;
		НоваяЗапись.ДатаНачалаПечати = ТекущаяДатаСеанса();
		НоваяЗапись.ДатаПечатиПоследнегоЧека = ТекущаяДатаСеанса();
		НоваяЗапись.РабочееМесто = РабочееМесто;
	КонецЕсли; 
	
	Попытка
		НаборЗаписейСтатусыГрупповойПечатиЧеков.Записать(Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;
				
	Возврат Результат;

КонецФункции

&НаСервере
Функция ЗаписатьОкончаниеПечатиЧековНаСервере()

	Результат = Истина;
	
	НаборЗаписейСтатусыГрупповойПечатиЧеков	= РегистрыСведений.лб_СтатусыГрупповойПечатиЧеков.СоздатьНаборЗаписей();
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Использование 		= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ВидОплаты.Значение 			= ВидОплаты;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаНачала.Использование	 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаНачала.Значение 			= ПериодОплат.ДатаНачала;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаОкончания.Использование 	= Истина;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Отбор.ДатаОкончания.Значение 		= ПериодОплат.ДатаОкончания;
	НаборЗаписейСтатусыГрупповойПечатиЧеков.Прочитать();
	Если НаборЗаписейСтатусыГрупповойПечатиЧеков.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НаборЗаписейСтатусыГрупповойПечатиЧеков Цикл
			Если НЕ Запись.Завершена Тогда
				Запись.Завершена = Истина;
				Запись.ЗавершенаБезОшибок = Истина;
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли; 
	
	Попытка
		НаборЗаписейСтатусыГрупповойПечатиЧеков.Записать(Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;
				
	Возврат Результат;

КонецФункции

&НаСервере
Процедура Пауза(Интервал)

	ОбщегоНазначенияБТС.Пауза(Интервал);

КонецПроцедуры

&НаКлиенте
Процедура ПечататьВсеЧеки(Команда)
	
	Если ИспользоватьПаузуПриПечатиЧеков Тогда
		Если ИнтервалПаузыВСекундах = 0 Тогда
			Сообщить("Не задан интервал паузы в секундах.", СтатусСообщения.Внимание);
		КонецЕсли;
		Если КоличествоЧековПередПаузой = 0 Тогда
			Сообщить("Не задано количество чеков перед паузой.", СтатусСообщения.Внимание);
		КонецЕсли;
		Если ИнтервалПаузыВСекундах = 0 ИЛИ КоличествоЧековПередПаузой = 0 Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	СтатусГрупповойПечати = СтатусГрупповойПечатиНаСервере();
		
	Если СтатусГрупповойПечати.ЕстьРаботающаяОбработка Тогда
		Сообщить("Уже выполняется групповая печать чеков на рабочем месте """ + РабочееМесто + """ по виду оплат """ + ВидОплаты + """ за период с " + СтатусГрупповойПечати.ДатаНачала + " по " + СтатусГрупповойПечати.ДатаОкончания + ". Печать невозможна.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;
	
	РезультатПечатиПоследнегоЧека = Истина;
	
	Элементы.Прогресс.МаксимальноеЗначение = Объект.Документы.Количество();
	Прогресс = Элементы.Прогресс.МинимальноеЗначение;
	НапечатаноЧековПередПаузой = 0;
	
	Для Каждого Стр ИЗ Объект.Документы Цикл
		
		Если НЕ РезультатПечатиПоследнегоЧека Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗаписатьНачалоПечатиЧекаНаСервере() Тогда
			Возврат;
		КонецЕсли;
		
		Прогресс = Прогресс + 1;
		Если НЕ Стр.Пробит Тогда
		
			Если ИспользоватьПаузуПриПечатиЧеков Тогда
				Если НапечатаноЧековПередПаузой >= КоличествоЧековПередПаузой Тогда
					Пауза(ИнтервалПаузыВСекундах);
					НапечатаноЧековПередПаузой = 0;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Стр.ПараметрыДокумента) Тогда
				ПолучитьДанныеДляПечати(Стр)	
			КонецЕсли;
			
			//25.09.2019
			если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр.ПараметрыДокумента, "МассивЧеков") = ложь тогда				
			  продолжить;
			конецесли;	
			
			Если Стр.ПараметрыДокумента.МассивЧеков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если НЕ ОтправлятьЧекПочтой Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = Неопределено;
				
			Иначе
				Стр.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = ПолучитьНастройкиОтправкиОтчетов(Стр.ПараметрыДокумента.ИдентификаторУстройства).Отправляет1СEmail;
				//БИТ ЖКХ 13.05.2020
				если ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков) тогда
					
					 Если НЕ ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail) Тогда 	
						Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = ПолучитьEmailПроживающего(Стр.Документ);
					 КонецЕсли;	
											
					 если ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail) = ложь тогда 	
						Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = ЭтотОбъект.АдресЭлектроннойПочты;
					 конецесли;	
				конецесли;	
			КонецЕсли;
			
			Если НЕ ОтправлятьЧекSMS Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = "";
				
			Иначе
				 Если НЕ ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер) Тогда 	
					Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = ПолучитьТелефонПроживающего(Стр.Документ.бит_ЛицевойСчет);
				 КонецЕсли;	
				Стр.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = ПолучитьНастройкиОтправкиОтчетов(Стр.ПараметрыДокумента.ИдентификаторУстройства).Отправляет1СSMS;
			КонецЕсли;
		
			Если (ОтправлятьЧекSMS И ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер)) ИЛИ (ОтправлятьЧекПочтой И ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail)) Тогда
				Если НЕПечататьЧек Тогда			
					Стр.ПараметрыДокумента.МассивЧеков[0].Электронно = Истина;
					
				КонецЕсли;	
				
			КонецЕсли;
			
			// БИТ ЖКХ 19.02.2020
			Если НЕПечататьЧек = истина Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].Электронно = Истина;
			конецесли;	
			
			//ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ));
			//25.09.2019
			если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") тогда 
			 // БИТ ЖКХ 27.04.2020
			 попытка
		      ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокументаОбщая",Новый Структура("Ключ",Стр.Документ));
		     исключение
			  ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ)); 
	         конецпопытки;  			  
		    иначе
		     ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ));
		    конецесли;
			
			Если Стр.ПараметрыДокумента.МассивЧеков.Количество() > 0 Тогда
				НапечататьОдинЧек(ФормаДок, Стр.ПараметрыДокумента.МассивЧеков, Стр.ПараметрыДокумента.ИдентификаторУстройства, Стр.ПараметрыДокумента.ВерсияФормата);
			КонецЕсли;
			
			Если Не Отладка_НеМенятьНомерЧекаККМ Тогда
				// БИТ ЖКХ 23.05.2020
				ФормаДок.Объект.РучнаяКорректировка = ложь;
				Попытка
				ФормаДок.Записать();
				Исключение
				
				КонецПопытки;
			    КонецЕсли;
			Если ФормаДок.Объект.НомерЧекаККМ <> 0 Тогда
				Стр.Пробит = Истина;
				НапечатаноЧековПередПаузой = НапечатаноЧековПередПаузой + 1;
			Иначе
				Стр.Пробит = Ложь;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;	
	
	ЗаписатьОкончаниеПечатиЧековНаСервере();
	
	//25.09.2019
	ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Пробит", ложь);
	НайденныеСтроки = Объект.Документы.НайтиСтроки(ПараметрыОтбора);
	
	если НайденныеСтроки.Количество() > 0 тогда
	 Сообщить("Чеки не пробиты!");
    иначе
	 Сообщить("Чеки пробиты!");
	конецесли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметры(Форма)
	
	ДокОбъект = Форма.Объект;
	
	ОчиститьСообщения();
	
	ОписаниеОшибки = "";
	
	Если ДокОбъект.НомерЧекаККМ <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном устройстве!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	//Если ОбщегоНазначенияБПКлиент.ПроверитьВозможностьПечатиЧека(Форма) Тогда
	Если ПроверитьВозможностьПечатиЧека(Форма) Тогда
		
		Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
			Контекст = Новый Структура();
			Контекст.Вставить("Форма", Форма);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение", ЭтотОбъект, Контекст);
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
			ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
				НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"));
		Иначе
			ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВыбратьУстройство(ОповещениеВыбора, ТипОборудования, ТекстЗаголовкаВыбора, 
	
	СообщениеНеПодключен = "", СообщениеНеВыбран = "", БезСообщений = Ложь, ТекстСообщения = "") 
	
	Если Не МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		Если Не БезСообщений Тогда
		      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипОборудования);
	
	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Если Не ПустаяСтрока(СообщениеНеПодключен) Тогда
			Если БезСообщений Тогда
				ТекстСообщения = СообщениеНеПодключен;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеНеПодключен);
			КонецЕсли;
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, Неопределено);
	Иначе
		СписокУстройств = Новый СписокЗначений();
		Для Каждого Устройства Из СписокДоступныхУстройств Цикл
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;
		Если СписокУстройств.Количество() = 1 Тогда
			Идентификатор = СписокУстройств[0].Значение;
			ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор); 
		ИначеЕсли НЕ КассаККМ.Пустая() Тогда
			Идентификатор = КассаККМ;
			ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор); 
		Иначе
			Контекст = Новый Структура;
			Контекст.Вставить("СледующееОповещение", ОповещениеВыбора);
			Контекст.Вставить("СообщениеНеВыбран"  , ?(ПустаяСтрока(СообщениеНеВыбран), СообщениеНеПодключен, СообщениеНеВыбран));
			Контекст.Вставить("БезСообщений"       , БезСообщений);
			//25.09.2019
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение", ЭтотОбъект, Контекст);
//			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);

			СписокУстройств.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры)Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства.Значение);
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	//ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства.Значение);
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
	ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
	
	Параметры.Вставить("ТипУстройства", ТипУстройства);
	
	Если ТипУстройства = "ККТ" Тогда
		//Форма = Параметры.Форма;
	
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
		//МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, Форма.УникальныйИдентификатор , ИдентификаторУстройства.Значение, Ложь);
		МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор , ИдентификаторУстройства, Ложь);
	Иначе
		ПолучитьПараметрыЗавершение(Неопределено, Параметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, Параметры) Экспорт
	
	Перем АдресУстановкиККТ, ОписаниеОшибки;	
	Если ПараметрыФискальногоУстройства =  Неопределено Тогда
		// Принтер чеков эмулирует все атрибуды ФФД 1.1
		пВерсияФормата = ?(Параметры.ТипУстройства = "ПринтерЧеков", "1.1.0.0", "1.0.0.0");
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		пВерсияФормата = ПечатьФискальныхДокументовКлиент.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
		ПараметрыФискальногоУстройства.ВыходныеПараметры.Свойство("АдресУстановкиККТ", АдресУстановкиККТ);
	КонецЕсли; 
	
	// Если не удалось подключить ККТ, то формировать чеки смысла нет
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Параметры.ИдентификаторУстройства);
		НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		
		МассивЧеков = СобратьДанные(Параметры.Форма.Объект.Ссылка,пВерсияФормата,Параметры.ИдентификаторУстройства);
		//МассивЧеков = СобратьДанные(Элементы.Документы.ТекущиеДанные.Документ,пВерсияФормата,Параметры.ИдентификаторУстройства);
		
		//07.8.2019
		ОбъектТекущегоДокумента = Параметры.Форма.Объект.Ссылка;
		//ОбъектТекущегоДокумента = Элементы.Документы.ТекущиеДанные.Документ;
		
		для каждого стр из МассивЧеков[0].ПозицииЧека цикл
			стр.ПризнакСпособаРасчета = Объект.Документы[0].ПризнакиСпособаРасчета;
			
			//20.09.2019
			если ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") и стр.СтавкаНДС = 0 или 
				  ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") и стр.СтавкаНДС = 0 или
				   ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") и стр.СтавкаНДС = 0 тогда
				НДСИзПоступления = ПолучитьНДСИзДокумента(ОбъектТекущегоДокумента);
				стр.СтавкаНДС = НДСИзПоступления.СтавкаНДС;
				стр.СуммаНДС = НДСИзПоступления.СуммаНДС;
			конецесли;
			
		конеццикла;	
		
		ПараметрСтроки = Новый Структура("МассивЧеков,ИдентификаторУстройства,ВерсияФормата",МассивЧеков, Параметры.ИдентификаторУстройства, пВерсияФормата);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		РезультатПечатиПоследнегоЧека = Ложь;
		
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	

КонецПроцедуры

//20.09.2019
функция ПолучитьНДСИзДокумента(Док)	
	
  ндс = новый Структура();	
  ндс.Вставить("СтавкаНДС", 0);//
  
  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/120") > 0  тогда
	ндс.СтавкаНДС = 120;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "20") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/120") = 0 тогда	
	ндс.СтавкаНДС = 20;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/110") > 0  тогда
	ндс.СтавкаНДС = 110;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "10") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/110") = 0 тогда	
	ндс.СтавкаНДС = 10;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/118") > 0  тогда
	ндс.СтавкаНДС = 118;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "18") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/118") = 0 тогда	
	ндс.СтавкаНДС = 18;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  //shevtsov 22.01.25 Начало
  Если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "22") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/122") = 0 тогда	
	ндс.СтавкаНДС = 22;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    Возврат ндс;     
  КонецЕсли;
  //shevtsov 22.01.25 Окончание
  
  ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
  возврат ндс;    
  
конецфункции	

&НаКлиенте
Процедура НапечататьОдинЧек(Форма, МассивЧеков, ИдентификаторУстройства, ВерсияФормата)
	ДокОбъект = Форма.Объект;
	
	ОбщиеПараметры    = МассивЧеков[0];
	
	Контекст = Новый Структура();
	Контекст.Вставить("МассивЧеков", МассивЧеков);
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Контекст.Вставить("ВерсияФормата", ВерсияФормата);
	Контекст.Вставить("Форма", Форма);
	
	Оповещение = Новый ОписаниеОповещения("НапечататьОдинЧекЗавершение", ЭтотОбъект, Контекст);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыПечатиЧека",     МассивЧеков[0]);
	ПараметрыФормы.Вставить("Организация",             ДокОбъект.Организация);
	ПараметрыФормы.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ПараметрыФормы.Вставить("ВерсияФормата",           ВерсияФормата);
	
	Если ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 118 Тогда
		ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 18; 
	ИначеЕсли ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 110 Тогда
		ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 10;
	//shevtsov 22.01.25 Начало
	ИначеЕсли ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 122 Тогда
		ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 22;
	//shevtsov 22.01.25 Окончание
	КонецЕсли;	

	МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
		Форма.УникальныйИдентификатор, 
		ПараметрыФормы.ПараметрыПечатиЧека, 
		ПараметрыФормы.ИдентификаторУстройства,
		,
		,
		);

КонецПроцедуры

&НаКлиенте
Процедура НапечататьОдинЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = Параметры.Форма;
	ДокОбъект = Форма.Объект;
	
	Если РезультатВыполнения.Результат Тогда
		
		Параметры.МассивЧеков.Удалить(0);
		ДокОбъект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		
		Если Параметры.МассивЧеков.Количество() > 0 Тогда
			НапечататьОдинЧек(Форма, Параметры.МассивЧеков, Параметры.ИдентификаторУстройства, Параметры.ВерсияФормата);
		Иначе
			Модифицированность = Истина;
			Если Не Отладка_НеМенятьНомерЧекаККМ Тогда
				Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		РезультатПечатиПоследнегоЧека = Ложь;
		
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанные(пСсылка,пВерсияФормата,пИдентификаторУстройства) 
	//08.08.2019
	Возврат ПечатьФискальныхДокументов.СобратьДанныеЧеков(пСсылка,, пВерсияФормата,пИдентификаторУстройства); 
КонецФункции

&НаСервере
Функция ПолучитьМассивДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ПериодОплат.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодОплат.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидОплаты", ВидОплаты);
	Запрос.УстановитьПараметр("ОрганизацияКассы", КассаККМ.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	               |ГДЕ
	               |	ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ПоступлениеНаРасчетныйСчет.Проведен
	               |	И ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.ДокументОснование.бит_ДокументОснование.лб_ВидОплаты, 
				   |					ЗНАЧЕНИЕ(Справочник.лб_ВидыОплат.ПустаяСсылка)) = &ВидОплаты
	               |	И ПоступлениеНаРасчетныйСчет.НомерЧекаККМ = 0
	               |	И ПоступлениеНаРасчетныйСчет.Организация = &ОрганизацияКассы";
	
	ТЗДокументов = Запрос.Выполнить().Выгрузить();
	МассивДокументов = ТЗДокументов.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Параметры.МассивДокументов.Количество() = 0 Тогда
	////06.08.2019	
	//  Сообщение = Новый СообщениеПользователю();
	//  Сообщение.Текст = НСтр("ru='Открытие формы печати без документов запрещено'");
	//  Сообщение.Поле = "Печать чека";
	//  Сообщение.УстановитьДанные(Объект);
	//  Сообщение.Сообщить();
	//  
	//  Отказ = истина;
	//  возврат;	  

	//Иначе		
		
	//	МассивДокументов = ПолучитьМассивДокументов();
	//
	//	Для каждого стр из МассивДокументов Цикл
	//		Добавить = Объект.Документы.Добавить();
	//		Добавить.Документ = стр.Ссылка;
	//		Добавить.ИмяДок = стр.Метаданные().Имя;
	//		Добавить.ПризнакиСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	//		Если стр.НомерЧекаККМ <> 0 Тогда
	//			Добавить.Пробит = Истина;
	//		Иначе
	//			Добавить.Пробит = Ложь;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеДляПечати(СсылкаДокумент)	
	
	Если ТипЗнч(СсылкаДокумент) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		СтрокаТаблицы = СсылкаДокумент;
		
		ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		
		//25.09.2019
		//если ТипЗнч(СсылкаДокумент.Документ) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") тогда 
		// ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокументаОднострочная",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		//иначе
		// ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		//конецесли;  	
		
		ПолучитьПараметры(ФормаДок);
		
		СтрокаТаблицы.ПараметрыДокумента = ПараметрСтроки;
		
		ПараметрСтроки = Неопределено;			
	Иначе
		
		Для каждого стр	из Объект.Документы.НайтиСтроки(Новый Структура("Документ",СсылкаДокумент)) Цикл 
			
			ФормаДок = ПолучитьФорму("Документ."+стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",стр.Документ));
			
			ПолучитьПараметры(ФормаДок);
			
			стр.ПараметрыДокумента = ПараметрСтроки;
			
			ПараметрСтроки = Неопределено;		
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьНастройки(Ссылка)
	
	ИдентификаторНастроек = СтрШаблон("НастройкиОтправкиСообщений_%1", Ссылка.Метаданные().Имя);
	Возврат ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("ПечатьЧека", ИдентификаторНастроек);	
	
КонецФункции

&НаКлиенте
Процедура ДокументыПриАктивизацииСтроки(Элемент)
	
	ОчиститьСообщения();
	
	Если Объект.Документы.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.Документ) Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Элементы.Меню.Доступность = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПараметрыДокумента) Тогда
		ПолучитьДанныеДляПечати(ТекущиеДанные)	
	КонецЕсли; 	
	
	Попытка
		Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
			//АдресЭлектроннойПочты = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail;
			//НомерТелефона = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер;

			НастройкиОтправкиСообщений = ПолучитьНастройки(ТекущиеДанные.Документ);
			
			Если НастройкиОтправкиСообщений <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиОтправкиСообщений, "ОтправлятьEmail, ОтправлятьSMS");
			КонецЕсли;
			
			ОтправлятьEmail = ОтправлятьEmail И ЗначениеЗаполнено(АдресЭлектроннойПочты);
			ОтправлятьSMS   = ОтправлятьEmail И ЗначениеЗаполнено(НомерТелефона);			
			
			ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0]);
			Организация = Строка(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Организация);
			СистемаНалогообложения = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения;
			
		КонецЕсли;
	Исключение
		
		//ОтправлятьEmail = Ложь;
		//
		//ОтправлятьSMS = Ложь;
		//
		//АдресЭлектроннойПочты = "";
		//
		//НомерТелефона = "";
		
		Элементы.ПробитьЧек.Доступность = Ложь;
				
		Организация = "";
		
		СистемаНалогообложения = Неопределено;
		
		ПечатнаяФорма.УстановитьТекст("");
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПечатнуюФорму(ПараметрыЧека)
ПечатнаяФорма.УстановитьТекст(МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоЧека(ПараметрыЧека));
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения = СистемаНалогообложения;
	ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0]);
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	//ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	//
	//Устройство = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.ИдентификаторУстройства;	
	//
	//Если ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
	//	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = АдресЭлектроннойПочты;
	//	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = ПолучитьНастройкиОтправкиОтчетов(Устройство).Отправляет1СEmail;
	//Иначе
	//	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = "";
	//	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = Ложь;
	//КонецЕсли;
	//
	//ОтправлятьEmail = ЗначениеЗаполнено(АдресЭлектроннойПочты);
	//
	//ОбработкаПроверкиЗаполненияНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Устройство = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.ИдентификаторУстройства;	
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = НомерТелефона;
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = ПолучитьНастройкиОтправкиОтчетов(Устройство).Отправляет1СSMS;
	Иначе
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = "";
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = Ложь;			
	КонецЕсли;
	
	ОтправлятьSMS = ЗначениеЗаполнено(НомерТелефона);
	
	ОбработкаПроверкиЗаполненияНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтправкиОтчетов(Устройство)	
	Возврат РегистрыСведений.ОборудованиеПоОрганизациям.Получить(Новый Структура("Оборудование", Устройство));		
КонецФункции

&НаКлиенте
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ)
	
	Отправляет1СSMS = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS;
	Отправляет1СEmail = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail;
	
	// Чек должен отправляться только через ОФД любым из способов
	ЧекОтправляетсяЧерезОФД = (НЕ ОтправлятьSMS ИЛИ НЕ Отправляет1СSMS) И (НЕ ОтправлятьEmail ИЛИ НЕ Отправляет1СEmail) 
		И (ОтправлятьSMS ИЛИ ОтправлятьEmail);
	
	Если НЕПечататьЧек И НЕ ЧекОтправляетсяЧерезОФД Тогда
		ОписаниеОшибки = НСтр("ru = 'Необходимо либо напечатать чек либо отправить его в электронном виде по email/sms через ОФД.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, ,"ПечататьЧек", "Объект", Отказ);
	Иначе
		Если ОтправлятьEmail Тогда
			Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ТекстСообщения = "";
				ВидСообщения   = "Заполнение";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения,"Адрес электронной почты",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "АдресЭлектроннойПочты", "Объект", Отказ);
			ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресЭлектроннойПочты) Тогда 
				ТекстСообщения = НСтр("ru = 'Неверный формат адреса электронной почты.'");
				ВидСообщения   = "Корректность";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения,"Адрес электронной почты",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "АдресЭлектроннойПочты", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ОтправлятьSMS Тогда
			НомерТелефонаБезПрефикса = ?(СтрНайти(НомерТелефона, "+") = 1, Сред(НомерТелефона, 2), НомерТелефона);
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				ТекстСообщения = "";
				ВидСообщения   = "Заполнение";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения, "Номер телефона",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "НомерТелефона", "Объект", Отказ);
			ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерТелефонаБезПрефикса) 
				ИЛИ НЕ ОрганизацииФормыКлиентСервер.ТелефонСоответствуетТребованиям(НомерТелефонаБезПрефикса) Тогда
				
				ТекстСообщения = НСтр("ru = 'Неверный формат номера телефона.'");
				ВидСообщения   = "Корректность";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения, "Номер телефона",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "НомерТелефона", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Если отправляем и по emal и по SMS и при этом пользуемся услугами ОФД.
		Если ОтправлятьEmail И ОтправлятьSMS 
			И НЕ(Отправляет1СEmail ИЛИ Отправляет1СSMS) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При отправке электронного чека через ОФД необходимо выбрать или email или sms'"), ,,,Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Объект.Документы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДокументОткрытие(Элемент, СтандартнаяОбработка)
	
	Строка = Объект.Документы.НайтиСтроки(Новый Структура("Документ", Элементы.Документы.ТекущиеДанные.Документ))[0];	
	Строка.ПараметрыДокумента = Неопределено;
	ПечатнаяФорма.Очистить();
	
	ОтправлятьEmail = Ложь;
	
	ОтправлятьSMS = Ложь;
	
	АдресЭлектроннойПочты = "";
	
	НомерТелефона = "";
	
	Элементы.ПробитьЧек.Доступность = Ложь;
	
	//Организация = "";
	
	СистемаНалогообложения = Неопределено;
	
	ПечатнаяФорма.УстановитьТекст("");

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриОкончанииРедактированияНаСервере()
    ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.Документ) Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Элементы.Меню.Доступность = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПараметрыДокумента) Тогда
		ПолучитьДанныеДляПечати(ТекущиеДанные)	
	КонецЕсли;
	
	
	Попытка
		Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
			АдресЭлектроннойПочты = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail;
			НомерТелефона = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер;

			НастройкиОтправкиСообщений = ПолучитьНастройки(ТекущиеДанные.Документ);
			
			Если НастройкиОтправкиСообщений <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиОтправкиСообщений, "ОтправлятьEmail, ОтправлятьSMS");
			КонецЕсли;
			
			ОтправлятьEmail = ОтправлятьEmail И ЗначениеЗаполнено(АдресЭлектроннойПочты);
			ОтправлятьSMS   = ОтправлятьEmail И ЗначениеЗаполнено(НомерТелефона);			
			
			ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0]);
			Организация = Строка(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Организация);
			СистемаНалогообложения = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения;
			
		КонецЕсли;
	Исключение
		
		ОтправлятьEmail = Ложь;
		
		ОтправлятьSMS = Ложь;
		
		АдресЭлектроннойПочты = "";
		
		НомерТелефона = "";
		
		Элементы.ПробитьЧек.Доступность = Ложь;
				
		//Организация = "";
		
		СистемаНалогообложения = Неопределено;
		
		ПечатнаяФорма.УстановитьТекст("");
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
  попытка	
		
   для каждого стр из Элемент.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПозицииЧека цикл	  
	стр.ПризнакСпособаРасчета = Элемент.ТекущиеДанные.ПризнакиСпособаРасчета;
   конеццикла;
   ДокументыПриОкончанииРедактированияНаСервере();
  исключение
  конецпопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументовНаСервере()
	Если КассаККМ.Пустая() Тогда
		Сообщить("Необходимо выбрать кассу ККМ и вид оплаты");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидОплаты) Тогда
		Сообщить("Необходимо выбрать вид оплаты");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодОплат) Тогда
		Сообщить("Необходимо указать период оплат");
		Возврат;
	КонецЕсли;
	
	Если ПериодОплат.ДатаОкончания < ПериодОплат.ДатаНачала Тогда
		Сообщить("Начало периода оплат не может быть позже конца периода");
		Возврат;
	КонецЕсли;
	
	Если (ПериодОплат.ДатаОкончания - ПериодОплат.ДатаНачала) / (60 * 60 * 24) > 5 Тогда
		Сообщить("Выбран слишком большой период оплат. Период не может быть более 5 дней.");
		Возврат;
	КонецЕсли;
	
	Объект.Документы.Очистить();
	МассивДокументов = ПолучитьМассивДокументов();

	Для каждого стр из МассивДокументов Цикл
		Добавить = Объект.Документы.Добавить();
		Добавить.Документ = стр.Ссылка;
		Добавить.ИмяДок = стр.Метаданные().Имя;
		Добавить.ПризнакиСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		Если стр.НомерЧекаККМ <> 0 Тогда
			Добавить.Пробит = Истина;
		Иначе
			Добавить.Пробит = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуДокументов(Команда)
	
	ЗаполнитьТаблицуДокументовНаСервере();
	Если Объект.Документы.Количество() > 0 Тогда
		Элементы.Документы.ТекущаяСтрока = Объект.Документы[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	КассаККМПриИзмененииНаСервере();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура КассаККМПриИзмененииНаСервере()
	
	Если НЕ КассаККМ.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПодключаемоеОборудование", КассаККМ);
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	лб_ДоступныеВидыОплатДляКассыККМ.ВидОплаты КАК ВидОплаты
			|ИЗ
			|	РегистрСведений.лб_ДоступныеВидыОплатДляКассыККМ КАК лб_ДоступныеВидыОплатДляКассыККМ
			|ГДЕ
			|	лб_ДоступныеВидыОплатДляКассыККМ.ПодключаемоеОборудование = &ПодключаемоеОборудование
			|";
		
		ТЗВидовОплат = Запрос.Выполнить().Выгрузить();
		МассивВидовОплат = ТЗВидовОплат.ВыгрузитьКолонку("ВидОплаты");
		//СЗВидовОплат = Новый СписокЗначений;
		//СЗВидовОплат.ЗагрузитьЗначения(МассивВидовОплат);
		
		Элементы.ВидОплаты.СписокВыбора.ЗагрузитьЗначения(МассивВидовОплат);
		Если ТЗВидовОплат.Найти(ВидОплаты, "ВидОплаты") = Неопределено Тогда
			ВидОплаты = Справочники.лб_ВидыОплат.ПустаяСсылка();
		КонецЕсли;
		
		//Если ТЗВидовОплат.Количество() > 0 Тогда
		//	Результат = Строка(ТЗКонтИнф[0].АдресПочты);
		//КонецЕсли;
	КонецЕсли;
	Организация = КассаККМ.Организация;
	Объект.Документы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	КассаККМПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидОплатыПриИзмененииНаСервере()
	Объект.Документы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	ВидОплатыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодОплатПриИзмененииНаСервере()
	Объект.Документы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПериодОплатПриИзменении(Элемент)
	ПериодОплатПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	Если ИспользоватьПаузуПриПечатиЧеков Тогда
		Элементы.ГруппаПаузыПравая.Доступность = Истина;
	Иначе
		Элементы.ГруппаПаузыПравая.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПаузуПриПечатиЧековПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

// Функция проверяет возможность печати чека на фискальном регистраторе.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма документа
//
// Возвращаемое значение:
//	Булево - Признак возможности печати
//
&НаКлиенте
Функция ПроверитьВозможностьПечатиЧека(Форма)
	ПечататьЧек = Истина;
	
	// Если объект не проведен или модифицирован - сообщим пользователю, что печать не возможна.
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.")
		И (НЕ Форма.Объект.Проведен
		ИЛИ Форма.Модифицированность) Тогда
		
		ПоказатьПредупреждение( , НСтр("ru = 'Операция возможна только после проведения документа'"));
		ПечататьЧек = Ложь;
		
	КонецЕсли;
	
	Возврат ПечататьЧек;
КонецФункции
